/*
Copyright © 2026 NAME HERE <EMAIL ADDRESS>
*/
package cmd

import (
	"encoding/json"
	"fmt"
	"os"
	"strconv"

	"github.com/spf13/cobra"
)

// deleteCmd represents the delete command
var deleteCmd = &cobra.Command{
	Use:   "delete",
	Short: "Удаление задачи по номеру",
	Args:  cobra.ExactArgs(1), // Cobra проверит, что передан ровно 1 аргумент,
	Run: func(cmd *cobra.Command, args []string) {
		// 1. Конвертируем строку в число (индекс)
		idx, err := strconv.Atoi(args[0])
		if err != nil {
			fmt.Println("Ошибка: введите корректный номер задачи")
			return
		}

		// 2. Читаем файл
		fileData, err := os.ReadFile("tasks.json")
		if err != nil {
			fmt.Println("Файл не найден")
			return
		}

		var tasks []Task
		json.Unmarshal(fileData, &tasks)

		// 3. Проверяем, существует ли такой индекс
		// Мы выводили список начиная с 1, поэтому отнимаем 1 для работы со слайсом
		realIdx := idx - 1
		if realIdx < 0 || realIdx >= len(tasks) {
			fmt.Println("Ошибка: задачи с таким номером нет")
			return
		}

		// 4. Удаляем задачу из слайса
		// Мы берем всё ДО нужного индекса и объединяем со всем, что ПОСЛЕ него
		tasks = append(tasks[:realIdx], tasks[realIdx+1:]...)

		data, _ := json.MarshalIndent(tasks, "", "  ")
		os.WriteFile("tasks.json", data, 0644)

		fmt.Println("Задача удалена! 🗑️")
	},
}

func init() {
	rootCmd.AddCommand(deleteCmd)
}

/*
tasks[:realIdx] — берем элементы с начала до удаляемого (не включая его).
tasks[realIdx+1:] — берем элементы от следующего после удаляемого до самого конца.
... (variadic) — это «распаковка».
Мы говорим Go: «Возьми этот второй кусок слайса и добавь его элементы по одному в первый кусок».
Без этих точек Go попытается засунуть слайс внутрь слайса, и будет ошибка.
*/
